Revit 2027 API
PerformanceAdviser.GetElementFilterFromRule(Int32, Document) Method
 Retrieves a filter to restrict elements to be checked.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementFilter GetElementFilterFromRule(
	int index,
	Document document
)
Public Function GetElementFilterFromRule (
	index As Integer,
	document As Document
) As ElementFilter
public:
ElementFilter^ GetElementFilterFromRule(
	int index,
	Document^ document
)
member GetElementFilterFromRule :
        index : int *
        document : Document -> ElementFilter
Parameters
index Int32
 The rule index to get information for.
document Document
 Document for which performance problems are being checked.
Return Value
ElementFilter
 The filter to restrict elements to be checked.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PerformanceAdviser Class
GetElementFilterFromRule Overload
Autodesk.Revit.DB Namespace